---
type: IFCTransformSetter
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 5
tags: [revit-api, class]
---

# IFCTransformSetter

`Autodesk.Revit.DB.IFC.IFCTransformSetter` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static IFCTransformSetter Create ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Initialize | 2012 | `public void Initialize ( ExporterIFC exporterIFC , Transform transform )` |
| Method | InitializeFromBoundingBox | — | `public Transform InitializeFromBoundingBox ( ExporterIFC exporterIFC , IList < GeometryObject > geometryList , IFCExtrusionCreationData exportBodyParams )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |